### With the help of Pandas, we can perform many functions on data set like Slicing, Indexing, Manipulating, and Cleaning Data frame. 
### Case 1: Slicing Pandas Data frame using DataFrame.iloc[]

In [7]:
import numpy as np
import pandas as pd

In [8]:
# Initializing the nested list with Data set
player_list = [['M.S.Dhoni', 36, 75, 5428000], 
               ['A.B.D Villers', 38, 74, 3428000], 
               ['V.Kholi', 31, 70, 8428000],
               ['S.Smith', 34, 80, 4428000], 
               ['C.Gayle', 40, 100, 4528000],
               ['J.Root', 33, 72, 7028000],
               ['K.Peterson', 42, 85, 2528000]]

In [9]:
len(player_list)

7

In [15]:
np.array(player_list)

array([['M.S.Dhoni', '36', '75', '5428000'],
       ['A.B.D Villers', '38', '74', '3428000'],
       ['V.Kholi', '31', '70', '8428000'],
       ['S.Smith', '34', '80', '4428000'],
       ['C.Gayle', '40', '100', '4528000'],
       ['J.Root', '33', '72', '7028000'],
       ['K.Peterson', '42', '85', '2528000']], dtype='<U13')

In [16]:
df = pd.DataFrame(player_list, columns=['Name', 'Age', 'Weight', 'Salary'])

In [20]:
df

            Name Age Weight   Salary
0      M.S.Dhoni  36     75  5428000
1  A.B.D Villers  38     74  3428000
2        V.Kholi  31     70  8428000
3        S.Smith  34     80  4428000
4        C.Gayle  40    100  4528000
5         J.Root  33     72  7028000
6     K.Peterson  42     85  2528000

In [19]:

# Slicing rows in data frame
df1 = df.iloc[0:4]
  
# data frame after slicing
df1

            Name Age Weight   Salary
0      M.S.Dhoni  36     75  5428000
1  A.B.D Villers  38     74  3428000
2        V.Kholi  31     70  8428000
3        S.Smith  34     80  4428000

In [21]:
# Sorting by column 'Weight'
df.sort_values(by=['Weight'])

            Name Age Weight   Salary
4        C.Gayle  40    100  4528000
2        V.Kholi  31     70  8428000
5         J.Root  33     72  7028000
1  A.B.D Villers  38     74  3428000
0      M.S.Dhoni  36     75  5428000
3        S.Smith  34     80  4428000
6     K.Peterson  42     85  2528000